Hayden-Schmidt/OpenApex/firmware/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32c3"
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y
CONFIG_FREERTOS_HZ=1000
CONFIG_LVGL_ENABLE=y
# Fonts the 240px screens actually use: 20 for the odometer bubble, 44 for the idle clock
# (design reference/2. Idle Screen). Each built-in face costs flash, so enable a size only when a
# page needs it. The 466px RICH tier wants larger still — that needs an lv_font_conv-generated
# face, not another built-in, since LVGL's bundled Montserrat stops at 48.
CONFIG_LV_FONT_MONTSERRAT_20=y
CONFIG_LV_FONT_MONTSERRAT_44=y
# Audio, microphone, and codec features are intentionally absent from Phase 1.

# BLE: NimBLE host, peripheral role (terminal advertises and hosts the nav GATT service; the
# Android relay connects as central and writes packets in). Central/observer roles are unused for
# now — see docs/OpenApex_SPEC.md §16.5 for why the terminal is the peripheral, not the phone.
CONFIG_BT_ENABLED=y
CONFIG_BT_NIMBLE_ENABLED=y
CONFIG_BT_NIMBLE_ROLE_CENTRAL=n
CONFIG_BT_NIMBLE_ROLE_OBSERVER=n
CONFIG_BT_NIMBLE_ROLE_PERIPHERAL=y
CONFIG_BT_NIMBLE_ROLE_BROADCASTER=y
CONFIG_BT_NIMBLE_MAX_CONNECTIONS=1
# Bond storage must survive reboot: the "bike on -> device boots -> phone reconnects" flow relies
# on the terminal and phone staying bonded across power cycles, not re-pairing every boot.
CONFIG_BT_NIMBLE_NVS_PERSIST=y
